; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v1 ?v2)
             (pred_11 ?v13 ?v10)
             (pred_5 ?v1 ?v10)
             (pred_2 ?v5 ?v1 )
	     (pred_8 ?v1)
             (pred_3 ?v11)
             (pred_10 ?v13)
             (pred_1 ?v10)
             (pred_4 ?v1)
             (pred_9 ?v13)
             (pred_6 ?v1)
             (pred_12 ))



(:action op_5
:parameters (?v8 ?v3 ?v9 ?v7)
:precondition (and (pred_3 ?v8) (pred_3 ?v3) (pred_10 ?v9) (pred_1 ?v7)
          (pred_7 ?v8 ?v3) (pred_11 ?v9 ?v7)
                   (pred_5 ?v3 ?v7) (pred_8 ?v8) 
                   (pred_4 ?v3) (pred_9 ?v9))
:effect (and  (pred_6 ?v3) (not (pred_4 ?v3))))


(:action op_4
:parameters (?v8 ?v12)
:precondition (and (pred_3 ?v8) (pred_3 ?v12)
               (pred_8 ?v8) (pred_7 ?v8 ?v12) (pred_6 ?v12))
:effect (and (pred_8 ?v12) (not (pred_8 ?v8))))

(:action op_1
:parameters (?v8 ?v9)
:precondition (and (pred_3 ?v8) (pred_10 ?v9) 
                  (pred_8 ?v8) (pred_2 ?v9 ?v8) (pred_12 ))
:effect (and (pred_9 ?v9)
   (not (pred_2 ?v9 ?v8)) (not (pred_12 ))))


(:action op_2
:parameters (?v8 ?v4 ?v6)
:precondition (and (pred_3 ?v8) (pred_10 ?v4) (pred_10 ?v6)
                  (pred_8 ?v8) (pred_9 ?v6) (pred_2 ?v4 ?v8))
:effect (and (pred_9 ?v4) (pred_2 ?v6 ?v8)
        (not (pred_9 ?v6)) (not (pred_2 ?v4 ?v8))))

(:action op_3
:parameters (?v8 ?v9)
:precondition (and (pred_3 ?v8) (pred_10 ?v9) 
                  (pred_8 ?v8) (pred_9 ?v9))
:effect (and (pred_12 ) (pred_2 ?v9 ?v8) (not (pred_9 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_14 obj_02 obj_01 obj_12 obj_15 obj_07 obj_06 obj_17 obj_16 obj_03 obj_20 obj_10 obj_13 obj_08 obj_18
    obj_05 obj_04
    obj_09 obj_19
    )

    (:init
       (pred_12)

       (pred_3 obj_11)
       (pred_3 obj_14)
       (pred_3 obj_02)
       (pred_3 obj_01)
       (pred_3 obj_12)
       (pred_3 obj_15)
       (pred_3 obj_07)
       (pred_3 obj_06)
       (pred_3 obj_17)
       (pred_3 obj_16)
       (pred_3 obj_03)
       (pred_3 obj_20)
       (pred_3 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_08)
       (pred_3 obj_18)
       (pred_1 obj_05)
       (pred_1 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_19)

       (pred_7 obj_11 obj_12)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_02)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_02 obj_01)
       (pred_7 obj_02 obj_14)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_12 obj_17)
       (pred_7 obj_12 obj_15)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_15 obj_16)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_12)
       (pred_7 obj_07 obj_03)
       (pred_7 obj_07 obj_06)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_07 obj_15)
       (pred_7 obj_06 obj_20)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_06 obj_07)
       (pred_7 obj_17 obj_10)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_17 obj_12)
       (pred_7 obj_16 obj_13)
       (pred_7 obj_16 obj_03)
       (pred_7 obj_16 obj_15)
       (pred_7 obj_16 obj_17)
       (pred_7 obj_03 obj_08)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_03 obj_07)
       (pred_7 obj_03 obj_16)
       (pred_7 obj_20 obj_18)
       (pred_7 obj_20 obj_06)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_13 obj_08)
       (pred_7 obj_13 obj_16)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_08 obj_18)
       (pred_7 obj_08 obj_03)
       (pred_7 obj_08 obj_13)
       (pred_7 obj_18 obj_20)
       (pred_7 obj_18 obj_08)
       (pred_4 obj_02)
       (pred_4 obj_03)
       (pred_5  obj_02 obj_05)
       (pred_5  obj_03 obj_04)
       (pred_6 obj_11)
       (pred_6 obj_14)
       (pred_6 obj_01)
       (pred_6 obj_12)
       (pred_6 obj_15)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_17)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_10)
       (pred_6 obj_13)
       (pred_6 obj_08)
       (pred_6 obj_18)

       (pred_11  obj_09 obj_05)
       (pred_11  obj_19 obj_04)
       (pred_2 obj_09 obj_16)
       (pred_2 obj_19 obj_10)
       (pred_8 obj_14)
    )

    (:goal (and
       (pred_2 obj_19 obj_18)
    ))
(:constraints
  (always (not (pred_8 obj_15)))
)
)

; plan
1. (op_4 obj_14 obj_11)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_12)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_12)
   goals met: 0 of 1
3. (op_4 obj_12 obj_17)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_17)
   goals met: 0 of 1
4. (op_4 obj_17 obj_10)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_10)
   goals met: 0 of 1
5. (op_1 obj_10 obj_19)
   deleted: (pred_2 obj_19 obj_10) (pred_12)
   added: (pred_9 obj_19)
   goals met: 0 of 1
6. (op_4 obj_10 obj_13)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_13)
   goals met: 0 of 1
7. (op_4 obj_13 obj_08)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_08)
   goals met: 0 of 1
8. (op_4 obj_08 obj_18)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_18)
   goals met: 0 of 1
9. (op_3 obj_18 obj_19)
   deleted: (pred_9 obj_19)
   added: (pred_12) (pred_2 obj_19 obj_18)
   goals met: 1 of 1
